<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_24187" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="0" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_771" type="Const" version="opset1">
			<data element_type="boolean" shape="1, 1, 2048, 2048" offset="3072" size="4194304" />
			<output>
				<port id="0" precision="BOOL" names="onnx::Slice_484">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_24175" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="4197376" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_640" type="Const" version="opset1">
			<data element_type="boolean" shape="1, 1, 2048, 2048" offset="4200448" size="4194304" />
			<output>
				<port id="0" precision="BOOL" names="onnx::Slice_346">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_24163" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8394752" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_24151" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8397824" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_24139" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8400896" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_24127" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8403968" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_24115" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8407040" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_24103" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8410112" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_24091" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8413184" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_24079" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8416256" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_24067" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8419328" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_24055" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8422400" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model.transformer.wte.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50257, 768" offset="8425472" size="154389504" />
			<output>
				<port id="0" precision="FP32" names="model.transformer.wte.weight">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_25543" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="162814976" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model/transformer/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Reshape_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_186" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="20" name="/model/transformer/wte/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/wte/Gather_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model.transformer.wpe.weight" type="Const" version="opset1">
			<data element_type="f32" shape="2048, 768" offset="162815000" size="6291456" />
			<output>
				<port id="0" precision="FP32" names="model.transformer.wpe.weight">
					<dim>2048</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model/transformer/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="23" name="ShapeOf_25408" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_25409" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="Constant_25410" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="26" name="Gather_25411" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Cast_output_0,/model/transformer/Gather_output_0" />
			</output>
		</layer>
		<layer id="27" name="/model/transformer/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="28" name="/model/transformer/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_184" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/model/transformer/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_188" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="32" name="/model/transformer/wpe/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2048</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/wpe/Gather_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/model/transformer/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Add_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_497" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model/transformer/h.0/ln_1/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/ln_1/Div_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_24051" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="169106472" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/model/transformer/h.0/ln_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/ln_1/Mul_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_24052" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="169109544" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model/transformer/h.0/ln_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/ln_1/Add_1_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Transpose_22918" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="169112616" size="2359296" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model/transformer/h.0/attn/attention/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/k_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model/transformer/h.0/attn/attention/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="171471912" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/model/transformer/h.0/attn/attention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Reshape_1_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_551" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="171471944" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model/transformer/h.0/attn/attention/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Cast_1_output_0,/model/transformer/h.0/attn/attention/Transpose_1_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="ShapeOf_25426" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_25427" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="171471976" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_25428" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="49" name="Gather_25429" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/h.0/attn/attention/Slice_1_output_0,/model/transformer/h.0/attn/attention/Slice_output_0,/model/transformer/h.0/attn/attention/Unsqueeze_7_output_0,/model/transformer/h.0/attn/attention/Unsqueeze_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/model/transformer/h.0/attn/attention/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/h.0/attn/attention/Sub_output_0,/model/transformer/h.0/attn/attention/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model/transformer/h.0/attn/attention/Constant_21" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/h.0/attn/attention/Constant_21_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Concat_21758" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_22646" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="171471984" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Concat_21759" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_21763" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="171471988" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_21762" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="171472004" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/model/transformer/h.0/attn/attention/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="BOOL" names="/model/transformer/h.0/attn/attention/Slice_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_22921" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="171472020" size="2359296" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model/transformer/h.0/attn/attention/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/q_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model/transformer/h.0/attn/attention/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="171471912" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model/transformer/h.0/attn/attention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Reshape_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_531" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="171471944" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model/transformer/h.0/attn/attention/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Cast_output_0,/model/transformer/h.0/attn/attention/Transpose_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/model/transformer/h.0/attn/attention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/MatMul_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/model/transformer/h.0/attn/attention/Constant_23" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="173831316" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/h.0/attn/attention/Constant_23_output_0" />
			</output>
		</layer>
		<layer id="66" name="/model/transformer/h.0/attn/attention/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/h.0/attn/attention/Where_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_24053" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="173831320" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_432" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/model/transformer/Unsqueeze_10" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_10_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_434" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="171471976" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model/transformer/Unsqueeze_11" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_11_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="ShapeOf_25416" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_25417" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_25418" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="75" name="Gather_25419" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Gather_1_output_0,/model/transformer/Unsqueeze_12_output_0,/model/transformer/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model/transformer/Constant_20" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_20_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_25413" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Reshape_25414" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_13_output_0,/model/transformer/Unsqueeze_15_output_0,/model/transformer/Unsqueeze_2_output_0,/model/transformer/Unsqueeze_3_output_0,/model/transformer/Unsqueeze_8_output_0,/model/transformer/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_25422" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_25423" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="81" name="Gather_25424" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Gather_2_output_0,/model/transformer/Unsqueeze_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/model/transformer/Concat_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/transformer/Concat_4_output_0,/model/transformer/Reshape_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model/transformer/Mul_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="173831324" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Mul_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model/transformer/Equal_1" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model/transformer/Equal_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/model/transformer/ConstantOfShape_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="173831356" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/ConstantOfShape_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/model/transformer/Where_2" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Where_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/model/transformer/Expand_1" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Expand_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model/transformer/Cast_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/transformer/Cast_4_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model/transformer/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Sub_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model/transformer/Cast_5" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="/model/transformer/Cast_5_output_0,/model/transformer/Cast_6_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/model/transformer/Constant_24" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="173831316" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/Constant_24_output_0" />
			</output>
		</layer>
		<layer id="92" name="/model/transformer/Where_3" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/Cast_7_output_0,/model/transformer/Where_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model/transformer/Cast_8" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="/model/transformer/Cast_8_output_0,/model/transformer/Cast_9_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model/transformer/Constant_25" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="173831316" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/Constant_25_output_0" />
			</output>
		</layer>
		<layer id="95" name="/model/transformer/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="96" name="Constant_202" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="173831316" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="97" name="Constant_22648" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="171471984" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model/transformer/Concat_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Concat_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/model/transformer/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/ConstantOfShape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="ShapeOf_25435" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_25436" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_25437" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="103" name="Gather_25438" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Slice_1_output_0,/model/transformer/Slice_output_0,/model/transformer/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Squeeze_25440" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/transformer/Cast_1_output_0,/model/transformer/Squeeze_1_output_0,/model/transformer/Squeeze_output_0" />
			</output>
		</layer>
		<layer id="105" name="/model/transformer/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="106" name="/model/transformer/Range_1" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Range_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_24054" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model/transformer/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Add_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_25544" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="173831388" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/model/transformer/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/model/transformer/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model/transformer/Cast_2_output_0,/model/transformer/Less_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/model/transformer/Constant_15" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="173831404" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="113" name="/model/transformer/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/Cast_3_output_0,/model/transformer/Where_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_262" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="162814992" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/model/transformer/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Unsqueeze_5_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_264" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/model/transformer/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Unsqueeze_6_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/model/transformer/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="169106456" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/model/transformer/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Sub_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/model/transformer/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Add_2_output_0,/model/transformer/Unsqueeze_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/model/transformer/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/transformer/Concat_3_output_0,/model/transformer/Reshape_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/model/transformer/Mul" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="173831324" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Mul_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/model/transformer/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model/transformer/Equal_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/model/transformer/ConstantOfShape_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="173831356" size="32" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/ConstantOfShape_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="/model/transformer/Where_1" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Where_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/model/transformer/Expand" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Expand_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/model/transformer/Where_4" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/Where_4_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/model/transformer/h.0/attn/attention/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Add_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/model/transformer/h.0/attn/attention/Softmax" type="SoftMax" version="opset8">
			<data axis="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/transformer/h.0/attn/attention/Cast_2_output_0,/model/transformer/h.0/attn/attention/Softmax_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Transpose_22930" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="173831408" size="2359296" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/model/transformer/h.0/attn/attention/v_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/v_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="/model/transformer/h.0/attn/attention/Concat_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="171471912" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="/model/transformer/h.0/attn/attention/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
