<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="1,4" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_13483_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="0" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_13483" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_771" type="Const" version="opset1">
			<data element_type="boolean" shape="1, 1, 2048, 2048" offset="1536" size="4194304" />
			<output>
				<port id="0" precision="BOOL" names="onnx::Slice_484">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_13471_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="4195840" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_13471" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_640" type="Const" version="opset1">
			<data element_type="boolean" shape="1, 1, 2048, 2048" offset="4197376" size="4194304" />
			<output>
				<port id="0" precision="BOOL" names="onnx::Slice_346">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_13459_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8391680" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_13459" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_13447_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8393216" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_13447" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_13435_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8394752" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_13435" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_13423_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8396288" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_13423" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_13411_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8397824" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_13411" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_13399_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8399360" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_13399" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_13387_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8400896" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_13387" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_13375_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8402432" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_13375" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_13363_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8403968" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_13363" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_13351_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="8405504" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_13351" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model.transformer.wte.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="50257, 768" offset="8407040" size="77194752" />
			<output>
				<port id="0" precision="FP16" names="model.transformer.wte.weight">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model.transformer.wte.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_14839" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="85601792" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model/transformer/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Reshape_output_0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_187" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="33" name="/model/transformer/wte/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/wte/Gather_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model.transformer.wpe.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2048, 768" offset="85601816" size="3145728" />
			<output>
				<port id="0" precision="FP16" names="model.transformer.wpe.weight">
					<dim>2048</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model.transformer.wpe.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model/transformer/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="37" name="ShapeOf_14704" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_14705" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="88747544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="39" name="Constant_14706" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="Gather_14707" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Cast_output_0,/model/transformer/Gather_output_0" />
			</output>
		</layer>
		<layer id="41" name="/model/transformer/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="88747544" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="42" name="/model/transformer/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Range_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_185" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model/transformer/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_189" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="46" name="/model/transformer/wpe/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2048</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/wpe/Gather_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model/transformer/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Add_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_371" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model/transformer/h.0/ln_1/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/ln_1/Div_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_13347_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="88747560" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_13347" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model/transformer/h.0/ln_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/ln_1/Mul_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_13348_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="88749096" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_13348" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/model/transformer/h.0/ln_1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/ln_1/Add_1_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_12214_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="88750632" size="1179648" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_12214" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model/transformer/h.0/attn/attention/k_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/k_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model/transformer/h.0/attn/attention/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="89930280" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model/transformer/h.0/attn/attention/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Reshape_1_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_425" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="89930312" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/model/transformer/h.0/attn/attention/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Cast_1_output_0,/model/transformer/h.0/attn/attention/Transpose_1_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="ShapeOf_14722" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_14723" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="89930344" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_14724" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="66" name="Gather_14725" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/h.0/attn/attention/Slice_1_output_0,/model/transformer/h.0/attn/attention/Slice_output_0,/model/transformer/h.0/attn/attention/Unsqueeze_7_output_0,/model/transformer/h.0/attn/attention/Unsqueeze_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model/transformer/h.0/attn/attention/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/h.0/attn/attention/Sub_output_0,/model/transformer/h.0/attn/attention/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/model/transformer/h.0/attn/attention/Constant_21" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/h.0/attn/attention/Constant_21_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Concat_11054" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_11942" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="89930352" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Concat_11055" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_11059" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="89930356" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_11058" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="89930372" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model/transformer/h.0/attn/attention/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="BOOL" names="/model/transformer/h.0/attn/attention/Slice_3_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Transpose_12217_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="89930388" size="1179648" />
			<output>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Transpose_12217" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/model/transformer/h.0/attn/attention/q_proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/q_proj/MatMul_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model/transformer/h.0/attn/attention/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="89930280" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model/transformer/h.0/attn/attention/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Reshape_output_0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_405" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="89930312" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/model/transformer/h.0/attn/attention/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/Cast_output_0,/model/transformer/h.0/attn/attention/Transpose_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/model/transformer/h.0/attn/attention/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/h.0/attn/attention/MatMul_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model/transformer/h.0/attn/attention/Constant_23" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="91110036" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/h.0/attn/attention/Constant_23_output_0" />
			</output>
		</layer>
		<layer id="84" name="/model/transformer/h.0/attn/attention/Where" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/h.0/attn/attention/Where_output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_13349_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="91110040" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_13349" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_306" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/model/transformer/Unsqueeze_10" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_10_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_308" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="89930344" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model/transformer/Unsqueeze_11" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_11_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="ShapeOf_14712" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_14713" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="85601808" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_14714" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="94" name="Gather_14715" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Gather_1_output_0,/model/transformer/Unsqueeze_12_output_0,/model/transformer/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model/transformer/Constant_20" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_20_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_14709" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_14710" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Unsqueeze_13_output_0,/model/transformer/Unsqueeze_15_output_0,/model/transformer/Unsqueeze_2_output_0,/model/transformer/Unsqueeze_3_output_0,/model/transformer/Unsqueeze_8_output_0,/model/transformer/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_14718" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747544" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_14719" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="100" name="Gather_14720" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Gather_2_output_0,/model/transformer/Unsqueeze_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/model/transformer/Concat_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/model/transformer/Concat_4_output_0,/model/transformer/Reshape_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model/transformer/Mul_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="91110042" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/transformer/Mul_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model/transformer/Equal_1" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/model/transformer/Equal_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model/transformer/ConstantOfShape_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="91110074" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/model/transformer/ConstantOfShape_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/model/transformer/Where_2" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Where_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/model/transformer/Expand_1" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Expand_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model/transformer/Cast_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/transformer/Cast_4_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model/transformer/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/Sub_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/model/transformer/Cast_5" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="/model/transformer/Cast_5_output_0,/model/transformer/Cast_6_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/model/transformer/Constant_24" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="91110036" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/Constant_24_output_0" />
			</output>
		</layer>
		<layer id="111" name="/model/transformer/Where_3" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model/transformer/Cast_7_output_0,/model/transformer/Where_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/model/transformer/Cast_8" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="/model/transformer/Cast_8_output_0,/model/transformer/Cast_9_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/model/transformer/Constant_25" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="91110036" size="4" />
			<output>
				<port id="0" precision="FP32" names="/model/transformer/Constant_25_output_0" />
			</output>
		</layer>
		<layer id="114" name="/model/transformer/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="115" name="Constant_203" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="91110036" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="Constant_11944" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="89930352" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/model/transformer/Concat_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Concat_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/model/transformer/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/transformer/ConstantOfShape_output_0">
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="ShapeOf_14731" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_14732" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_14733" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="85601808" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="122" name="Gather_14734" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Slice_1_output_0,/model/transformer/Slice_output_0,/model/transformer/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Squeeze_14736" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/transformer/Cast_1_output_0,/model/transformer/Squeeze_1_output_0,/model/transformer/Squeeze_output_0" />
			</output>
		</layer>
		<layer id="124" name="/model/transformer/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="88747544" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/transformer/Constant_9_output_0" />
			</output>
		</layer>
		<layer id="125" name="/model/transformer/Range_1" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/transformer/Range_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_13350" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="88747544" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/model/transformer/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/transformer/Add_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_14840" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="91110106" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/model/transformer/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
